hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
enum TxInitStage {
    TX_INIT_OFF,
    TX_INIT_WAITING,
    TX_INIT_TRANSMITTING,
};

static uint8_t txByte = 0;
static uint16_t txByteIdx = 0;
static int8_t txBitIdx = 0;
static uint16_t txDelayElapsed = 0;
static uint8_t txFlagsElapsed = 0;
static uint8_t txCrcByteIdx = 0;
static uint8_t txBitstuff = 0;
static uint16_t txTailElapsed;
static uint16_t txCrc = 0xFFFF;
static uint32_t txQuiet = 0;
// Slots the frame currently waiting to key up has already spent in the CSMA
// backoff, and how many of them found the channel busy. txRetries bounds the
// total wait (MAX_TRANSMIT_RETRY_COUNT); txBusySlots is what tells the two
// reasons a forced transmission can happen apart from each other, since a run
// mixes busy slots and missed persistence rolls freely. Both are cleared the
// moment the frame keys up.
static uint8_t txRetries = 0;
static uint8_t txBusySlots = 0;
static volatile uint32_t txPersistenceMissedCount = 0; // bumped once per forced TX after a run of clear-channel slots that all missed the persistence roll
static volatile uint32_t txChannelBusyCount = 0;       // bumped once per forced TX after a run that included at least one busy-channel slot
static volatile enum TxInitStage txInitStage;
static enum TxStage txStage;

// Ax25GetTxBit() runs in the DAC sample-clock ISR (IRAM_ATTR), so it cannot
// call ESP_LOGx directly - logging from an ISR risks blowing the ISR's stack
// and stalling the very timer that clocks the waveform out. Instead the ISR
// only sets these flags/counters (plain stores, single writer), and
// Ax25TransmitCheck() - which already runs once per service-task tick in
// normal task context - polls them and does the actual logging.
static volatile uint32_t txFramesSentCount = 0; // bumped once per frame fully clocked out
static volatile bool txJustKeyedDown = false;   // set true when TX tail finishes and PTT drops
// Set when pollTxEvents() logs "PTT OFF (unkeyed)"; makes Ax25TransmitCheck()
// skip re-keying for one service tick so consecutive/queued frames get a real,
// sustained PTT-off between them rather than the pin being dropped and re-
// asserted within the same tick.
static bool txReleaseHoldoff = false;
// Extra, user-configurable minimum PTT-off hold time (Ax25Config.minUnkeyTime),
// on top of the fixed one-tick txReleaseHoldoff above. Set to the deadline
// (millis()-based) at the same moment txReleaseHoldoff is set, in
// pollTxEvents(); Ax25TransmitCheck() will not re-key while millis() is still
// before it. 0 (the default) makes this a no-op: only the fixed one-tick floor
// applies.
static uint32_t txMinUnkeyUntil = 0;
// Diagnostic-only: millis() at the moment "PTT OFF (unkeyed)" was logged.
// Used solely to print the ACTUAL measured gap on the next "PTT ON" line, so
// a log capture can be checked against Ax25Config.minUnkeyTime directly
// instead of trusting that the gate logic above did its job. 0 means "no
// unkey observed yet" (e.g. first transmission since boot).
static uint32_t txLastUnkeyMillis = 0;

struct RxState {
    uint16_t crc;
    uint8_t frame[AX25_FRAME_MAX_SIZE];
    uint16_t frameIdx;
    uint8_t receivedByte;
    uint8_t receivedBitIdx;
    uint8_t rawData;
    enum Ax25RxStage rx;
#ifdef ENABLE_FX25
    struct Fx25Mode *fx25Mode;
    uint64_t tag;
#endif
};

static struct RxState rxState[MODEM_MAX_DEMODULATOR_COUNT];

static uint16_t lastCrc = 0;          // CRC of the last received frame
static uint16_t rxMultiplexDelay = 0; // avoids receiving the same frame twice

static uint16_t txDelay;
static uint16_t txTail;

static uint8_t outputFrameBuffer[AX25_FRAME_MAX_SIZE];

// Scratch buffer used only to linearize the about-to-transmit frame (which
// lives in the circular txBuffer) so it can be handed to ax25_decode() for
// the "PTT ON" log line. Separate from outputFrameBuffer since that one is
// used for RX frames and could otherwise be clobbered if both paths were
// ever serviced close together.
static uint8_t txLogBuffer[AX25_FRAME_MAX_SIZE];

// @brief Recalculate the CRC for one bit
// Called once per transmitted bit from Ax25GetTxBit(), which is IRAM_ATTR.
// -O2 will almost certainly inline it, but "almost certainly" is not a
// guarantee, and if it does not, every bit of every frame becomes a potential
// flash fetch from inside the sample ISR. Pin it.
static void IRAM_ATTR calculateCRC(uint8_t bit, uint16_t *crc) {
    uint16_t xor_result = *crc ^ bit;
    *crc >>= 1;
    if (xor_result & 0x0001)
        *crc ^= 0x8408;
}

#define countof(a) (sizeof(a) / sizeof(a[0]))

#define DECODE_CALL(buf, addr)                                                                                                                                 \
    for (unsigned i = 0; i < sizeof((addr)) - CALL_OVERSPACE; i++) {                                                                                           \
        char c = (char)(*(buf)++ >> 1);                                                                                                                        \
        (addr)[i] = (c == ' ') ? '\x0' : c;                                                                                                                    \
    }

#define AX25_SET_REPEATED(msg, idx, val)                                                                                                                       \
    do {                                                                                                                                                       \
        if (val)                                                                                                                                               \
            (msg)->rpt_flags |= (1u << (idx));                                                                                                                 \
        else                                                                                                                                                   \
            (msg)->rpt_flags &= ~(1u << (idx));                                                                                                                \
    } while (0)

