hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
    if (ringByteSpace(txBufferHead, RING_OBSERVE(txBufferTail)) < size) {
        ESP_LOGW(TAG, "TX buffer full, frame dropped (%u bytes, %u available)", size, ringByteSpace(txBufferHead, RING_OBSERVE(txBufferTail)));
        return NULL;
    }

    ESP_LOGI(TAG, "TX frame queued: %u bytes", size);

    // Decode the frame we just queued back into a readable TNC2 line
    // ("SRC>DST,PATH:info") for the serial log. ax25_decode() only reads the
    // buffer (so the const cast is safe) and returns false for non-UI/non-APRS
    // frames, which we simply don't print.
    //
    // This is a debug-only aid, and it is deliberately kept out of a stock
    // build: the block needs an ax25_msg_t (info[] alone is AX25_FRAME_MAX_SIZE
    // bytes, plus the address fields) and a 256-byte line buffer, roughly a
    // kilobyte of stack, and it sits at the very bottom of the TX call chain
    // (buildXxxPacket -> aprs_service_send_tnc2 -> modem_send_tnc2 ->
    // modem_build_frame_tnc2 -> ax25_encode -> here). That is the deepest
    // point of the path BEACON_SCHED_TASK_STACK_BYTES was sized against, so a
    // kilobyte spent here is a kilobyte of headroom the caller's task-sizing
    // comments cannot see. The whole block compiles out unless the build's
    // maximum log level admits ESP_LOGD (4 == ESP_LOG_DEBUG; the enum name
    // itself is not usable in a preprocessor test), and even then only runs
    // when this tag's level is actually raised to debug at run time.
#if defined(CONFIG_LOG_MAXIMUM_LEVEL) && (CONFIG_LOG_MAXIMUM_LEVEL >= 4)
    if (esp_log_level_get(TAG) >= ESP_LOG_DEBUG) {
        ax25_msg_t decoded;
        if (ax25_decode((uint8_t *)data, size, 0, &decoded)) {
            char tnc2[256];
            modem_format_tnc2(&decoded, tnc2, sizeof(tnc2));
            ESP_LOGD(TAG, "TX frame: %s", tnc2);
        }
    }
#endif

    txFrame[txFrameHead].size = size;
    txFrame[txFrameHead].start = txBufferHead;

#ifdef ENABLE_FX25
    txFrame[txFrameHead].fx25Mode = NULL;
#endif

    for (uint16_t i = 0; i < size; i++) {
        txBuffer[txBufferHead++] = data[i];
        txBufferHead %= FRAME_BUFFER_SIZE;
    }

    void *ret = &txFrame[txFrameHead];
    RING_PUBLISH(txFrameHead, RING_NEXT(txFrameHead)); // payload is in place
    return ret;
}

uint8_t Ax25TxFramesPending(void) {
    // Producer-side read of the same ring Ax25WriteTxFrame() checks: the tail
    // is only advanced by the DAC ISR's txRetireFrame(), once a queued
    // frame's transmission (including any quiet-time wait before it started)
    // is fully done. The distance from tail to head is therefore how many
    // frames are still "in the ring" - waiting to key up or on the air right
    // now - out of FRAME_MAX_COUNT-1 usable slots.
    //
    // txFrameHead is written by Ax25WriteTxFrame(), which normally runs on a
    // different task/core than the DAC ISR that calls this indirectly via
    // Ax25TransmitCheck() -> pollTxEvents(). Reading it as a plain load gave
    // no memory-ordering guarantee that a head update published from another
    // core would actually be observed here, so this could report a stale
    // (often zero) pending count even with frames genuinely queued. Use
    // RING_OBSERVE() for both ends of the ring, matching every other cross-
    // side read of these indices in this file.
    uint8_t head = RING_OBSERVE(txFrameHead);
    uint8_t tail = RING_OBSERVE(txFrameTail);
    return (uint8_t)((head + FRAME_MAX_COUNT - tail) % FRAME_MAX_COUNT);
}

uint32_t Ax25GetPersistenceMissedCount(void) {
    // Single writer (Ax25TransmitCheck(), the modem service task); safe plain read here, same pattern as txFramesSentCount
    return txPersistenceMissedCount;
}

uint32_t Ax25GetChannelBusyCount(void) {
    // Single writer (Ax25TransmitCheck(), the modem service task); safe plain read here, same pattern as txFramesSentCount
    return txChannelBusyCount;
}

bool Ax25ReadNextRxFrame(uint8_t **dst, uint16_t *size, int8_t *peak, int8_t *valley, uint8_t *level, uint8_t *corrected, uint16_t *mV) {
    uint8_t tail = rxFrameTail; // we own this one

    // Acquire: everything the producer wrote before its release store - the
    // handle AND the rxBuffer payload it points at - is visible from here on.
    if (tail == RING_OBSERVE(rxFrameHead))
        return false;

    const struct FrameHandle *h = &rxFrame[tail];
    uint16_t start = h->start;
    uint16_t len = h->size;

    if (len > AX25_FRAME_MAX_SIZE) // cannot happen; do not overrun if it does
        len = AX25_FRAME_MAX_SIZE;

    *dst = outputFrameBuffer;
    for (uint16_t i = 0; i < len; i++)
        (*dst)[i] = rxBuffer[(start + i) % FRAME_BUFFER_SIZE];

    *peak = h->peak;
    *valley = h->valley;
    *level = h->level;
    *size = len;
    *corrected = h->corrected;
    *mV = h->mVrms;

    // Release the bytes first, then the slot: the producer must never conclude
    // the payload is reusable before we have finished copying it out.
    RING_PUBLISH(rxBufferTail, (uint16_t)((start + h->size) % FRAME_BUFFER_SIZE));
    RING_PUBLISH(rxFrameTail, RING_NEXT(tail));
    return true;
}

enum Ax25RxStage Ax25GetRxStage(uint8_t modem) {
    // Public component API: the index is bounded against the rxState array
    // here rather than trusted, so a caller outside the component cannot read
    // past it. An out-of-range demodulator reports RX_STAGE_IDLE, which is
    // what every consumer already treats as "nothing in progress".
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT)
        return RX_STAGE_IDLE;

    return rxState[modem].rx;
}

void Ax25BitParse(uint8_t bit, uint8_t modem, uint16_t mV) {
    if (lastCrc != 0) { // a frame was received
        rxMultiplexDelay++;
        if (rxMultiplexDelay > RX_DEDUP_HOLD_CALLS) {
            // hold it for a while and wait for the other decoders to receive it
            lastCrc = 0;
            rxMultiplexDelay = 0;
        }
    }

    struct RxState *rx = &rxState[modem];

    rx->rawData <<= 1;
    rx->rawData |= (bit > 0);

#ifdef ENABLE_FX25
    rx->tag >>= 1;
    if (bit)
        rx->tag |= 0x8000000000000000ULL;

    if (Ax25Config.fx25 && (rx->rx != RX_STAGE_FX25_FRAME) && (NULL != (rx->fx25Mode = (struct Fx25Mode *)Fx25GetModeForTag(rx->tag)))) {
        rx->rx = RX_STAGE_FX25_FRAME;
        rx->receivedByte = 0;
        rx->receivedBitIdx = 0;
        rx->frameIdx = 0;
        return;
    }

