hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
static void ax25_putRaw(uint8_t *raw, ax25_ctx_t *ctx, uint8_t c) {
    // No byte-level escaping here. The real HDLC bit-stuffing (insert a 0 bit
    // after five consecutive 1 bits) is done later, per bit, in Ax25GetTxBit().
    // Byte-level escaping here would inject a spurious 0x1B whenever a header
    // byte equalled 0x7E/0x7F/0x1B (e.g. SSID 15 encodes to 0x7E), corrupting
    // the transmitted frame.
    ctx->crc_out = update_crc_ccit(c, ctx->crc_out);
    *raw = c;
}

int hdlcFrame(uint8_t *outbuf, size_t outbuf_len, ax25_ctx_t *ctx, ax25_frame_t *pkg) {
    int i, j;
    int idx = 0;
    uint8_t data = 0;
    uint8_t info[AX25_FRAME_MAX_SIZE];

    ctx->crc_out = CRC_CCIT_INIT_VAL;

    for (i = 0; i < 10; i++)
        pkg->header[i].ssid &= 0xFE; // clear all end-of-path bits
    for (i = 1; i < 10; i++) {
        if (pkg->header[i].addr[0] == 0x00) {
            pkg->header[i - 1].ssid |= 0x01;
            break;
        }
    }

    for (i = 0; i < 10; i++) {
        if (pkg->header[i].addr[0] == 0)
            break;
        for (j = 0; j < 6; j++) {
            data = (uint8_t)pkg->header[i].addr[j];
            if (data == 0)
                data = 0x20;
            data <<= 1;
            if (idx >= (int)sizeof(info))
                return 0;
            ax25_putRaw(&info[idx++], ctx, data);
        }
        if (idx >= (int)sizeof(info))
            return 0;
        ax25_putRaw(&info[idx++], ctx, (uint8_t)pkg->header[i].ssid);
        if (pkg->header[i].ssid & 0x01)
            break;
    }

    ax25_putRaw(&info[idx++], ctx, AX25_CTRL_UI);      // 0x03 - APRS UI frame
    ax25_putRaw(&info[idx++], ctx, AX25_PID_NOLAYER3); // 0xF0 - no layer 3

    for (i = 0; i < (int)strlen(pkg->data); i++) {
        if (idx >= (int)sizeof(info))
            break;
        ax25_putRaw(&info[idx++], ctx, (uint8_t)pkg->data[i]);
    }

    if ((size_t)idx > outbuf_len)
        return 0;

    memcpy(outbuf, info, (size_t)idx);
    return idx;
}
